<template>
  <v-container class="aboutCon">
    <h1>{{ data.title }}</h1>
    <br />
    <p>{{ data.p1 }}</p>
    <br />
    <p>{{ data.p2 }}</p>
    <br />
    <p>{{ data.p3 }}</p>
  </v-container>
</template>

<script>
export default {
  props: {
    data: {
      type: Object,
      default: () => {
        return {
          title: 'عن مبرمجون',
          p1: 'مبرمجون هو مجتمع عربي  للمبرمجين بغرض طرح الاسئلة البرمجية والإجابة عليها وتبادل المعلومات والأفكار والخبرات في المواضيع البرمجية المختلفة.',
          p2: 'هدفنا هو جعل هذا المجتمع بمثابة ملتقى للمبرمجين العرب ليكون مكانهم المريح لتبادل المعلومات بطريقة منظمة وعلمية وموثوقة واستقاء المعلومات من مبرمجين ذوي خبرة وتجربة عملية، وإقامة النقاشات العلمية البناءة تحت الرقابة وبحسب قوانين الاستخدام. كذلك نحن نسعى ليكون مبرمجون هو المرجع الموثوق للمبرمجين العرب عند بحثهم عن حلول للمشاكل البرمجية التي تواجههم باللغة العربية. ',
          p3: 'مجتمع مبرمجون قائم بأسلوب حديث وإدارة جماعية بحيث يعتمد بشكل أساسي على تصويت المستخدمين لرفع المساهمات (الأصوات) على المحتوى الإيجابي وتخفيضها على المحتوى السلبي.لذلك نحن نعول على وعيكم لإدارة هذا المجتمع ليكون مجتمع عربي ناضج ومفيد.',
        }
      },
    },
  },
}
</script>

<style lang="scss">
.aboutCon {
  max-width: 50rem;
}
</style>
